{
  "posts": [
    {
      "id": 3,
      "date": "January 10, 2026",
      "title": "Admiral William Brown: The Foxford Boy Who Built a Navy",
      "content": "<p>How did a boy from rural County Mayo end up becoming a national hero on the other side of the world?</p><p>In this video, we dive into the incredible true story of Admiral William Brown (Guillermo Brown), the 'Father of the Argentine Navy.' Born in Foxford, Ireland, in 1777, we explore his humble beginnings to his legendary status as a 'Soldier of Freedom.'</p><p><strong>What we cover in this video:</strong></p><ul><li><strong>The Early Struggle:</strong> His journey to America and the tragic loss of his father.</li><li><strong>The Escape:</strong> How he was pressed into the Royal Navy and his daring escape from the 'unescapable' French fortress of Verdun.</li><li><strong>A New Nation:</strong> Why an Irish merchant in Buenos Aires was tasked with building a fleet from scratch to fight the Spanish Empire.</li><li><strong>Tactical Genius:</strong> The legendary St. Patrick's Day victory at Martín García Island and the decisive Battle of Montevideo.</li><li><strong>The Humanitarian:</strong> His emotional return to Ireland during the Great Famine.</li></ul><p>Admiral Brown is more than just a historical figure; he is a symbol of the deep bond between Ireland and Argentina. Today, he is honored with thousands of statues, streets, and even football clubs (Club Atlético Almirante Brown) bearing his name.</p><blockquote>'I do not regret my life, I have been a soldier of freedom.'</blockquote><div class='video-container'><iframe src='https://www.youtube.com/embed/d7dnUwFON3E' frameborder='0' allowfullscreen></iframe></div>"
    },
    {
      "id": 1,
      "date": "January 4, 2026",
      "title": "Irish History Tales Website",
      "content": "<p>Welcome to the new home of Irish History Tales. I’ve built this dedicated space to bring together my chronological history series and the world of my novel, <em>Verses in the Sand</em>.</p><p>Recently, it’s become clear that the TikTok algorithm is making it harder for long-form educational content to reach its audience. Because of this, I am shifting to a <strong>YouTube-first focus</strong>. While I will still share the story of Ireland on TikTok, YouTube will now be the primary home for my deeper dives into the forgotten figures and unsung heroes of our past.</p><p>I would be incredibly grateful for your support—whether through a like, a comment, or by exploring my book series. On that note, I’m thrilled to announce that Book 2 is nearing completion and will be released very soon!</p>"
    },
    {
      "id": 2,
      "date": "December 30, 2025",
      "title": "The Pretty Dragoon",
      "content": "<p>I really enjoyed researching and developing the content for the latest edition 'The Pretty Dragoon', which was a nickname given to the Irish woman - Kit Cavanagh, an extraordinary woman who joined the British army and served undiscovered in the army for 13 years.</p><p> She had been a tavern owner in Dublin and after her beloved husband was 'pressed' into the British Army, she volunteered to join the army to find him. During her search, she even duelled and killed a fellow soldier in a dispute over a woman, and a prostitute even accused her of being the 'father' of one of her children. </p><p> For more information, watch the full video on YouTube below </p><div class='video-container'><iframe src='https://www.youtube.com/embed/xr0I8zZt5fM' frameborder='0' allowfullscreen></iframe></div>"
    }
  ]
}